Masmiseim36/nxpSDK/boards/hvpkv46f150m/demo_apps/mc_bldc/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTD0 (number 93), FTM0_CH0
  @{ */
#define PINTOOL_PWM_FTM0_CH0_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_PWM_FTM0_CH0_PIN 0U     /*!<@brief PORTD pin index: 0 */
                                        /* @} */

/*! @name PORTD2 (number 95), FTM0_CH2
  @{ */
#define PINTOOL_PWM_FTM0_CH2_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_PWM_FTM0_CH2_PIN 2U     /*!<@brief PORTD pin index: 2 */
                                        /* @} */

/*! @name PORTD4 (number 97), FTM0_CH4
  @{ */
#define PINTOOL_PWM_FTM0_CH4_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_PWM_FTM0_CH4_PIN 4U     /*!<@brief PORTD pin index: 4 */
                                        /* @} */

/*! @name PORTD1 (number 94), FTM0_CH1
  @{ */
#define PINTOOL_PWM_FTM0_CH1_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_PWM_FTM0_CH1_PIN 1U     /*!<@brief PORTD pin index: 1 */
                                        /* @} */

/*! @name PORTD3 (number 96), FTM0_CH3
  @{ */
#define PINTOOL_PWM_FTM0_CH3_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_PWM_FTM0_CH3_PIN 3U     /*!<@brief PORTD pin index: 3 */
                                        /* @} */

/*! @name PORTD5 (number 98), FTM0_CH5
  @{ */
#define PINTOOL_PWM_FTM0_CH5_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_PWM_FTM0_CH5_PIN 5U     /*!<@brief PORTD pin index: 5 */
                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_PWM(void);

#define SOPT5_UART1RXSRC_UART_RX 0x00u /*!<@brief UART 1 receive data source select: UART1_RX pin */
#define SOPT5_UART1TXSRC_UART_TX 0x00u /*!<@brief UART 1 transmit data source select: UART1_TX pin */

/*! @name PORTC3 (number 73), UART1_RX
  @{ */
#define PINTOOL_UART_UART1_RX_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_UART_UART1_RX_PIN 3U     /*!<@brief PORTC pin index: 3 */
                                         /* @} */

/*! @name PORTC4 (number 76), UART1_TX
  @{ */
#define PINTOOL_UART_UART1_TX_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_UART_UART1_TX_PIN 4U     /*!<@brief PORTC pin index: 4 */
                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_UART(void);

/*! @name PORTC13 (number 85), Relay
  @{ */
#define PINTOOL_MISC_Relay_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define PINTOOL_MISC_Relay_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_MISC_Relay_PIN 13U    /*!<@brief PORTC pin index: 13 */
                                      /* @} */

/*! @name PORTB19 (number 65), USER_LED
  @{ */
#define PINTOOL_MISC_USER_LED_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define PINTOOL_MISC_USER_LED_PORT PORTB /*!<@brief PORT device name: PORTB */
#define PINTOOL_MISC_USER_LED_PIN 19U    /*!<@brief PORTB pin index: 19 */
                                         /* @} */

/*! @name PORTE1 (number 2), FAULT_1
  @{ */
#define PINTOOL_MISC_FAULT_1_PORT PORTE /*!<@brief PORT device name: PORTE */
#define PINTOOL_MISC_FAULT_1_PIN 1U     /*!<@brief PORTE pin index: 1 */
                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_Misc(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
